# KipPerFtSup2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KipPerFtSup2 Property
SymbolTypeId Class See Also
---
Symbol kip/ft², indicating unit Kips per square foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipPerFtSup2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipPerFtSup2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipPerFtSup2 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace